<?php

namespace App;

use Illuminate\Database\Eloquent\Model;

class CabinetMenu extends Model
{
    //
    public $data_nav_menu=[

        0 => ['href' => 'demo-lft-tab-1', 'data_href' => '/cabinet', 'btn_title' => 'Мой кабинет',
            'tab' => [
                'text' => 'В личном кабинете основные настройки функционала и доступы',
                //$m_ul
                0 => ['main' => true, 'data-text' => '/cabinet', 'name' => 'Главная'],
                1 => ['name' => 'Персональные данные',
                    //$mr
                    0 => ['name' => 'Персональные данные'],
                    1 => ['name' => 'Рассылка Магелан'],
                    2 => ['name' => 'Логин и пароль'],
                    3 => ['name' => 'Удаление учетной записи'],
                ],
                2 => ['name' => 'Настройка доступа',
                    0 => ['name' => 'Управление пользователями'],
                    1 => ['name' => 'Логин и пароль']
                ],
                3 => ['name' => 'Информация о компании',
                    0 => ['name' => 'Название компании, логотип, описание, адрес'],
                    1 => ['name' => 'График работы'],
                    2 => ['name' => 'Дополнительная информация о компании'],
                    3 => ['name' => 'Компания на карте города'],
                    4 => ['name' => 'Регистрационные документы компании'],
                    5 => ['name' => 'Реквизиты компании'],
                    6 => ['name' => 'Отзывы о компании'],
                    7 => ['name' => 'Быстрые оценки компании'],
                    8 => ['name' => 'Отзывы о товарах и услугах'],
                    9 => ['name' => 'Филиалы и представительства'],
                ],
                4 => ['name' => 'Рейтинги',
                    0 => ['name' => 'Рейтинг качества обслуживания'],
                    1 => ['name' => 'Программа лояльности']
                ],
            ]



    ],
    1=>['href'=>'demo-lft-tab-2','data_href'=>'/goods_and_groups','btn_title'=>'Товары и услуги',
    'tab' => [
                'text' => 'Second Tab Content',
                //$m_ul
                0 => ['name' => 'Управление товарами',
                    //$mr
                    0 => ['name' => 'Добавить позицию'],
                    1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Управление товарами и группами'],
                    2 => ['name' => 'Управление категориями товаров'],

                ],
                1 => ['name' => 'Витрина'],
                2 => ['name' => 'Менеджеры групп'],

            ]

    ],
    2=> ['href'=>'demo-lft-tab-3','data_href'=>'/','btn_title'=>'Заказы',
        'tab' => [
            'text' => 'Наслаждайся удобством управления заказами',
            //$m_ul

            0 => ['name' => 'Заказы'],
            1 => ['name' => 'Сообщения'],2 => ['name' => 'Клиенты'],3 => ['name' => 'Уведомления'],
            4 => ['name' => 'Настройка заказов ',
                //$mr
                0 => ['name' => 'Управление заказами и сообщениями'],
                1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Менеджеры групп товаров'],
                2 => ['name' => 'Почта для заказов и сообщений'],

            ],
        ]],
    3=> ['href'=>'demo-lft-tab-4','data_href'=>'/','btn_title'=>'Управление сайтом',
    'tab' => [
            'text' => 'Самое удобное управление вашей работой - это Магелан',
            //$m_ul

        0 => ['name' => 'Оформление',
            //$mr
            0 => ['name' => 'Дизайн сайта'],
            1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Управление главной'],
            2 => ['name' => 'Дополнительные настройки оформления'],
            3 => ['name' => 'Витрина'],
            4 => ['name' => 'Создание баннера'],

        ],
        1 => ['name' => 'Меню сайта'],

            2 => ['name' => 'Наполнение ',
                //$mr
                0 => ['name' => 'Статьи / Новости'],
                1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Файлы'],
                2 => ['name' => 'Фотогалерея'],
                3 => ['name' => 'Другие страницы'],

            ],
        3 => ['name' => 'Интернет магазин',
            //$mr
            0 => ['name' => 'Основные настройки интернет магазина'],
            1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Добавить способы доставки'],
            2 => ['name' => 'Добавить способы оплаты'],
            3 => ['name' => 'Условия возврата'],
            4 => ['name' => 'Регионы доставки'],
            5 => ['name' => 'Филиалы представительства'],
            6 => ['name' => 'Доменное имя'],

        ],
        4 => ['name' => 'Данные о компании',
            //$mr
            0 => ['name' => 'Название компании, логотип, описание, адрес'],
            1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Дополнительная информация о компании'],
            2 => ['name' => 'Реквизиты компании'],
            3 => ['name' => 'Регистрационные документы компании'],
            4 => ['name' => 'График работы'],
            5 => ['name' => 'Компания на карте города']

        ],
        5 => ['name' => 'Отзывы',
            //$mr
            0 => ['name' => 'Отзывы о товарах и услугах'],
            1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Быстрые оценки компании'],
            2 => ['name' => 'Отзывы о компании']

        ],
        6 => ['name' => 'Статистика',
            //$mr
            0 => ['name' => 'Сводная статистика'],
            1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Статистика за период'],
            2 => ['name' => 'Google Analitics'], 3 => ['name' => 'Статистика посещений'],

        ],
        ]
    ],
    4=> ['href'=>'demo-lft-tab-5','data_href'=>'/','btn_title'=>'Продвижение сайта',
        'tab' => [
            'text' => 'Продвижение сайта одна из самых важных сущностей в интернет торговле',
            //$m_ul


            0 => ['name' => 'Продвижение и развитие'],
            1 => ['name' => 'Университет электронной комерции'],
            2 => ['name' => 'Инструменты вебмастера и SEO'],
            3 => ['name' => 'Статистика'],

        ]

    ],
    5=> ['href'=>'demo-lft-tab-6','data_href'=>'/','btn_title'=>'Тарифы',
        'tab' => [
            'text' => 'Тарифы весьма лояльные',
            //$m_ul


            0 => ['name' => 'Платные услуги'],
            1 => ['name' => 'Продвижение и развитие '],
            2 => ['name' => 'Программа лояльности'],
            3 => ['name' => ' Счета'],
            4 => ['name' => ' Доступный бюджет'],
           5 => ['name' => ' Регулярные платежи'],

        ]
    ],
    6=> ['href'=>'demo-lft-tab-7','data_href'=>'/','btn_title'=>'Настройки',
        'tab' => [
            'text' => 'Система располагает очень гибкими и полезными настройками',
            //$m_ul


            0 => ['name' => 'Интернет магазин'],
            1 => ['name' => 'Основные настройки интернет магазина '],
            2 => ['name' => 'Добавить способ доставки'],
            3 => ['name' => ' Счета'],
            4 => ['name' => ' Добавить способ оплаты'],
            5 => ['name' => ' Условия возврата'],
            6 => ['name' => ' Регионы доставки'],
            7 => ['name' => ' Филиалы и представительства'],
            8 => ['name' => ' Доменное имя'],
            9 => ['name' => 'Настройки заказов',
                //$mr
                0 => ['name' => 'Управление заказами и сообщениями'],
                1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Менеджеры групп товаров'],
                2 => ['name' => 'Google Analitics'], 3 => ['name' => 'Почта для заказов и сообщений'],

            ],
            10 => ['name' => 'Оформление ',
                //$mr
                0 => ['name' => 'Дизайн сайта'],
                1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Управление главной'],
                2 => ['name' => 'Google Analitics'], 3 => ['name' => 'Дополнительные настройки оформления'],
                4 => ['name' => 'Google Analitics'], 5 => ['name' => 'Витрина'],
            ],
            11 => ['name' => 'Настройка доступа',
                //$mr
                0 => ['name' => 'Управление пользователями'],
                1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Логин и пароль']
            ],
            12 => ['name' => 'Персональные данные',
                //$mr
                0 => ['name' => 'Персональные данные'],
                1 => ['main' => true, 'data-text' => '/goods_and_groups','name' => 'Рассылка Магелан'],
                2 => ['name' => 'Логин и пароль'],3 => ['name' => 'Удаление учетной записи'],
            ],
            13 => ['name' => 'Изминить пароль'],

    ],
    7=> ['href'=>'demo-lft-tab-8','data_href'=>'/','btn_title'=>'Справка',
        'tab' => [
            'text' => 'Обширная проработанная справочная система',
            //$m_ul


            0 => ['name' => 'Карта кабинета'],
            1 => ['name' => 'Справка'],
            2 => ['name' => 'Чат с сотрудником Магелана']

        ]],


]
    ];
}
